// 寫這裡惠荃 pdf 34~67
let datas = `
1.|IP 位址可以區分為5個等級:|A、B、C、D、E|
2.|IP 位址。這個位址是獨一無二的|True|

30.
1.|如果想要擁有自己的網域名稱要去哪裡申請呢？|台灣網路資訊中心TWNIC|
2.|如果是國際化網域名稱|InterNIC|
3.|網路服務提供者（ISP）負責管理的名稱可以是中文網域名稱嗎?|可以|
4.|網域名稱分為4個部分|主機名稱、機構名稱、機構類別、地區名稱|
5.|主機名稱|依主機所提供的服務來表示。ex: google網頁主機www.、新聞主機news.|
6.|機構名稱|一般以公司名稱或機關名稱來表示。|
7.|機構類別|以工作性質來區分。ex: 教育單位以.edu 來表示|
8.|地區名稱| 名。ex: 台灣以.tw 來表示|
9.|.com|商業用|
10.|.edu|教育單位|
11.|.gov|政府單位|
12.|a.org|非營利組織|
13.|.net|網路服務供應商|
14.|.mil|美國軍事單位|
16.|.tw|台灣|
17.|.cn|中國大陸|
18.|.hk|香港|
19.|.jp|日本|
20.|.fr|法國|
21.|.uk|英國|
22.|.de|德國|
23.|.kr|南韓|
24.|在 DNS 伺服器裡,每一個網域名稱都會有自己的檔案|稱為區域檔案|
25.|檔案內容清楚地記載著關於自己及其他伺服器在網路上的詳細資訊|這個詳細的資訊叫做資源記錄|
26.|nslookup|取得DNS伺服器的一些資訊|
27.|IPv4 目前最大的問題|是使用32位元來定址，導致IP位址嚴重不足|
28.|IPv6|主要採用128位元來進行定址|
29.|IPv6總數量| 228 個位址|
30.|IPv6有它自己對O表示的規則(大致上有2個)|1.數字前的0可以省略,若省略後還是0,可以繼續省略。2.用雙冒號「::」來表示1組0或多組連續0,但只限出現1次。|
31.|假如有一個IPv4的位址想轉成IPv6 的格式可以嗎?|可以|
32.|IPv6有保留將IPv4完整對應過來的IP位址。方法有2種|1. 直接將 IPv4 位址抄過去,一樣用小數點「.」來表示,前面一位數加上ffff,其餘 左邊5位數全部補0 。2. 將IPv4 位址的4個10進位數字轉成2個16進位的數字,2個數字是用 冒號「:」隔開,前面一位數加上ffff,其餘 左邊5位數全部補0。|
33.|看到這麼長的數字要怎麼去記住它呢?|IPv6 具有隨插即用的功能,它有自動組態設定的機制,能自動設定 IP 位址,所以我們不用太過操心。|
34.|網路位址轉換技術(NAT)|NAT可以讓很多個虛擬私有IP位址，也就是沒有分配到合法公有IP 位址的電腦,在與網際網路溝通時,將私有IP轉換成所分配到的一個合法公有IP位址,讓沒有分配到合法公有IP位址的電腦們,也能夠隨心所欲地遨遊網際網路。|
35.|IPv6需不需用到NAT?|不需要，因為提供了大量IP位置。|
36.|||
