// 寫這裡宗諭 pdf 2~33
let datas = `
1.|IP 位址可以區分為5個等級:|A、B、C、D、E|
2.|IP 位址。這個位址是獨一無二的|True|
3.|IP Address 的意思 |網際網路通訊協定位址|
4.| 子網路遮罩的演算方式 |藉由子網路遮罩對網路上的IP 位址進行辨
識，並判斷是否屬於同一個網路環境|
5.|何者為國際化網域名稱 |.com、.net、.org|
6.|www為何種網域名稱 |主機名稱|
7.|以下何者為機構類別 |.edu|
8.|以下何者為地區名稱 |.uk|
9.|以下何者為URL address |www.google.com.tw|
10.|IPv4的表示方式為 |192.168.11.22|
11.|IPv6主要採用幾位元來進行定址 |128位元|
12.|何謂DHCP |幫區域網路內的每一台電腦分配一個IP位址|
13.|A級網路的左邊1個位元為 |0|
14.|B級網路的左邊2個位元為 |10|
15.|C級網路的左邊3個位元為 |110|
16.|C級網路的左邊4個位元為 |1110|
17.|D級網路的左邊5個位元為 |1111|
18.|如何找出廣播位址 |將子網路遮罩的16 個0變成1|
19.|基本上IPv6的子網路遮罩固定為多少位元 |64位元|
20.|NAT的功能為何 |主要是可以用1個真實的IP位址對外，讓很多
使用假IP位址的內部電腦可以上網|
21.|DHCP的功能為何 |主要是可以讓網管人員或使用者「自動取得
IP位址」，省掉為每一台電腦設定一堆數字的工作|
`